tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
bool IrrigationApp::saveLearnedZoneFlow(uint32_t expectedConfigRevision) {
    if (!BoardPins::isValidZoneId(pendingLearnedZoneId_) ||
        pendingLearnedBaselinePulseRateX10000_ == 0) {
        return false;
    }
    if (!saveZoneBaselinePulseRate(pendingLearnedZoneId_,
                                   pendingLearnedBaselinePulseRateX10000_,
                                   expectedConfigRevision)) {
        return false;
    }
    discardLearnedZoneFlow();
    return true;
}

bool IrrigationApp::saveManualZoneBaselineFlow(
    uint8_t zoneId,
    uint32_t flowMlPerMinute,
    uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!current || pendingLearnedZoneId_ != 0 ||
        flowMlPerMinute == 0 || flowMlPerMinute > 100000U) {
        return false;
    }
    uint32_t pulseRateX10000 = 0;
    if (!FlowMonitor::flowMlPerMinuteToPulseRateX10000(
            flowMlPerMinute,
            current->flowMeter.pulsesPerLiterX100,
            pulseRateX10000)) {
        return false;
    }
    uint32_t verifiedFlowMlPerMinute = 0;
    if (!FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
            pulseRateX10000,
            current->flowMeter.pulsesPerLiterX100,
            verifiedFlowMlPerMinute) ||
        verifiedFlowMlPerMinute != flowMlPerMinute) {
        return false;
    }
    return saveZoneBaselinePulseRate(
        zoneId, pulseRateX10000, expectedConfigRevision);
}

bool IrrigationApp::saveZoneBaselinePulseRate(
    uint8_t zoneId,
    uint32_t pulseRateX10000,
    uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.status().active || !current ||
        !BoardPins::isValidZoneId(zoneId) || pulseRateX10000 == 0) {
        return false;
    }
    IrrigationConfig next = *current;
    const uint32_t previousPulseRateX10000 =
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000;
    next.zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 =
        pulseRateX10000;
    if (!configStore_.save(next, expectedConfigRevision)) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    uint32_t savedFlowMlPerMinute = 0;
    uint32_t previousFlowMlPerMinute = 0;
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        previousPulseRateX10000,
        next.flowMeter.pulsesPerLiterX100,
        previousFlowMlPerMinute);
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        pulseRateX10000,
        next.flowMeter.pulsesPerLiterX100,
        savedFlowMlPerMinute);
    events_.recordZoneFlowSaved(
        zoneId, previousFlowMlPerMinute, savedFlowMlPerMinute);
    return true;
}

uint8_t IrrigationApp::pendingLearnedZoneId() const {
    return pendingLearnedZoneId_;
}

uint32_t IrrigationApp::pendingLearnedBaselinePulseRateX10000() const {
    return pendingLearnedBaselinePulseRateX10000_;
}

uint32_t IrrigationApp::pendingLearnedFlowMlPerMinute() const {
    const IrrigationConfig* current = configStore_.current();
    uint32_t flowMlPerMinute = 0;
    if (current) {
        FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
            pendingLearnedBaselinePulseRateX10000_,
            current->flowMeter.pulsesPerLiterX100,
            flowMlPerMinute);
    }
    return flowMlPerMinute;
}

bool IrrigationApp::clearLearnedZoneFlow(uint8_t zoneId,
                                         uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.status().active || !current ||
        pendingLearnedZoneId_ != 0 ||
        !BoardPins::isValidZoneId(zoneId) ||
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 == 0) {
        return false;
    }
    IrrigationConfig next = *current;
    uint32_t previousFlowMlPerMinute = 0;
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000,
        current->flowMeter.pulsesPerLiterX100,
        previousFlowMlPerMinute);
    next.zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 = 0;
    if (!configStore_.save(next, expectedConfigRevision)) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    events_.recordZoneFlowSaved(zoneId, previousFlowMlPerMinute, 0);
    return true;
}

void IrrigationApp::discardLearnedZoneFlow() {
    if (!wateringController_.status().active) {
        pendingLearnedZoneId_ = 0;
        pendingLearnedBaselinePulseRateX10000_ = 0;
    }
}

const IrrigationConfig* IrrigationApp::configuration() const {
    return configStore_.current();
}

bool IrrigationApp::saveConfiguration(const IrrigationConfig& proposed,
                                      uint32_t expectedRevision,
                                      IrrigationEvents::ConfigurationChange change,
                                      uint8_t objectId) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || !current) {
        return false;
    }
    BoardHardware& hardware = BoardHardware::instance();
    const bool active = wateringController_.status().active;
    const bool frequencyChanged = proposed.valveDrive.pwmFrequencyHz !=
                                  current->valveDrive.pwmFrequencyHz;
    bool hardwareChanged = false;
    if (frequencyChanged && !active) {
        if (!hardware.configureValvePwmFrequency(proposed.valveDrive.pwmFrequencyHz)) {
            return false;
        }
        hardwareChanged = true;
    }
    const uint32_t previousFrequency = current->valveDrive.pwmFrequencyHz;
    if (!configStore_.save(proposed, expectedRevision)) {
        if (hardwareChanged && !hardware.configureValvePwmFrequency(previousFrequency)) {
            businessReady_ = false;
            hardware.safeShutdown();
        }
        return false;
    }
    pendingPwmReconfigure_ = frequencyChanged && active;
    wateringScheduler_.rebaseTimeCheck();
    if (!active) {
        resetUnexpectedFlowMonitor(millis());
    }
    events_.recordConfigurationChanged(change, objectId);
    return true;
}

const char* IrrigationApp::configurationError() const {
    return configStore_.lastError();
}

void IrrigationApp::advanceBusiness() {
    if (!businessReady_) {
        BoardHardware::instance().safeShutdown();
        return;
    }
    const uint32_t nowMs = millis();
    if (!eventConditionsInitialized_) {
        events_.syncStorageStatus();
        refreshRtcCondition(nowMs, true);
        eventConditionsInitialized_ = true;
    }
    refreshRtcCondition(nowMs, false);
    wateringController_.handle(nowMs);
    reportNewFlowDeviationEvents();
    consumeFinishedWatering();
    const IrrigationConfig* config = configStore_.current();
    if (config && !wateringController_.status().active) {
        unexpectedFlowMonitor_.observe(nowMs, BoardHardware::instance().flowPulseCount());
    }
    if (config) {
        const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
        if (wateringScheduler_.storageReady()) {
            wateringScheduler_.handle(*config,
                                      now.synced,
                                      now.source == Esp32BaseTime::SOURCE_NTP,
                                      now.epochSec);
        }
        observeEventConditions(nowMs, now);
        Esp32BaseRecordStore::StoreStatus recordStatus{};
        Esp32BaseAppEvents::AppEventsStatus eventStatus{};
        if (wateringRecordStore_.readStatus(recordStatus) &&
            Esp32BaseAppEvents::readStatus(eventStatus)) {
            const uint64_t activitySequence =
                (static_cast<uint64_t>(recordStatus.nextRecordId) << 32U) |
                eventStatus.eventStore.nextRecordId;
            aliveCheckpoint_.handle(now,
                                    config->timeSafety.aliveCheckpointHours,
                                    wateringController_.status().active,
                                    activitySequence);
        }
    }
}

void IrrigationApp::reportNewFlowDeviationEvents() {
    const WateringStatus status = wateringController_.status();
    if (status.purpose != WateringPurpose::Normal) return;
    for (uint8_t index = 0; index < status.stepCount &&
                            index < status.zones.size(); ++index) {
        const ZoneWateringSummary& zone = status.zones[index];
        if (!BoardPins::isValidZoneId(zone.zoneId)) continue;
        const uint8_t zoneIndex = BoardPins::zoneIndex(zone.zoneId);
        if (!zone.lowFlowActive) {
            lowFlowEventReported_[zoneIndex] = false;
        } else if (!lowFlowEventReported_[zoneIndex]) {
            const bool stopped =
                !status.active &&
                status.lastStopReason == WateringStopReason::LowFlow;
            events_.recordFlowDeviationEvent(
                zone, IrrigationEvents::ReasonCode::LowFlow, stopped);
            lowFlowEventReported_[zoneIndex] = true;
        }
        if (!zone.highFlowActive) {
            highFlowEventReported_[zoneIndex] = false;
        } else if (!highFlowEventReported_[zoneIndex]) {
            const bool stopped =
                !status.active &&
                status.lastStopReason == WateringStopReason::HighFlow;
            events_.recordFlowDeviationEvent(
                zone, IrrigationEvents::ReasonCode::HighFlow, stopped);
            highFlowEventReported_[zoneIndex] = true;
        }
    }
}

void IrrigationApp::consumeFinishedWatering() {
    const WateringSessionSummary* summary = wateringController_.finishedSession();
    if (!summary) {
        return;
    }

    if (summary->purpose == WateringPurpose::FlowCalibration) {
        flowCalibrationService_.captureFinishedSession(*summary, trustedEpoch());
    } else if (summary->purpose == WateringPurpose::ZoneFlowLearning &&
               summary->zoneCount == 1 &&
               summary->zones[0].suggestedBaselinePulseRateX10000 != 0) {
        pendingLearnedZoneId_ = summary->zones[0].zoneId;
        pendingLearnedBaselinePulseRateX10000_ =
            summary->zones[0].suggestedBaselinePulseRateX10000;
    }

    if (summary->purpose == WateringPurpose::Normal && summary->anyFlowEstablished) {
        if (!wateringStartTimeValid_ ||
            !wateringRecordStore_.appendCompleted(wateringStartTime_, *summary)) {
            recordStorageFault_ = true;
            events_.recordWateringRecordSaveFailed(
                wateringStartTimeValid_ ? IrrigationEvents::ReasonCode::RecordAppendFailed
                                        : IrrigationEvents::ReasonCode::RecordStartTimeUnavailable,
                wateringRecordStore_.state(),
                wateringRecordStore_.lastError());
        } else {
            recordStorageFault_ = wateringRecordStore_.state() !=
                                  Esp32BaseRecordStore::StoreState::Ready;
        }
    }

    events_.recordAbnormalWateringStop(*summary);
    resetUnexpectedFlowMonitor(millis());
    applyPendingHardwareConfiguration();
    wateringController_.clearFinishedSession();
    wateringStartTime_ = {};
    wateringStartTimeValid_ = false;
}

uint32_t IrrigationApp::trustedEpoch() const {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return now.synced ? now.epochSec : 0;
}

void IrrigationApp::applyPendingHardwareConfiguration() {
    if (!pendingPwmReconfigure_ || wateringController_.status().active) {
        return;
    }
    const IrrigationConfig* config = configStore_.current();
    if (!config || !BoardHardware::instance().configureValvePwmFrequency(
                       config->valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    pendingPwmReconfigure_ = false;
}

void IrrigationApp::parameterConfigSaved(void* user) {
    if (user) static_cast<IrrigationApp*>(user)->handleParameterConfigSaved();
}

bool IrrigationApp::applyStoredParameterConfig() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return false;
    parameterConfigScratch_ = *current;
    return IrrigationParameterConfig::applyStored(parameterConfigScratch_) &&
           configStore_.applyRuntimeParameters(parameterConfigScratch_);
}

void IrrigationApp::handleParameterConfigSaved() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return;
    parameterConfigScratch_ = *current;
    if (!IrrigationParameterConfig::applyStored(parameterConfigScratch_)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    const bool frequencyChanged = parameterConfigScratch_.valveDrive.pwmFrequencyHz !=
                                  current->valveDrive.pwmFrequencyHz;
    const bool active = wateringController_.status().active;
    if (frequencyChanged && !active &&
        !BoardHardware::instance().configureValvePwmFrequency(
            parameterConfigScratch_.valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    if (!configStore_.applyRuntimeParameters(parameterConfigScratch_)) {
        businessReady_ = false;
        BoardHardware::instance().safeShutdown();
        return;
    }
    pendingPwmReconfigure_ = frequencyChanged && active;
    wateringScheduler_.rebaseTimeCheck();
    if (!active) resetUnexpectedFlowMonitor(millis());
    events_.recordConfigurationChanged(
        IrrigationEvents::ConfigurationChange::SystemParametersUpdated);
}

void IrrigationApp::resetUnexpectedFlowMonitor(uint32_t nowMs) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return;
    }
    unexpectedFlowMonitor_.begin(
        nowMs,
        BoardHardware::instance().flowPulseCount(),
        config->flowProtection.unexpectedFlowDelaySec,
        config->flowProtection.unexpectedFlowWindowSec,
        config->flowProtection.unexpectedFlowPulseCount);
    events_.observeClosedValveFlow(Esp32BaseAppEvents::ObservedConditionState::Unknown,
                                   0,
                                   config->flowProtection.unexpectedFlowWindowSec,
                                   config->flowProtection.unexpectedFlowPulseCount);
}

