tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
void IrrigationApp::refreshRtcCondition(uint32_t nowMs, bool force) {
    constexpr uint32_t kRtcRefreshIntervalMs = 60000U;
    if (!force && rtcObservationInitialized_ &&
        static_cast<uint32_t>(nowMs - lastRtcRefreshMs_) < kRtcRefreshIntervalMs) {
        return;
    }
    if (rtcObservationInitialized_) Esp32BaseRtc::refresh();
    rtcObservationInitialized_ = true;
    lastRtcRefreshMs_ = nowMs;
    events_.observeRtcAvailability(Esp32BaseRtc::isAvailable(),
                                   static_cast<uint8_t>(Esp32BaseRtc::status()));
}

void IrrigationApp::observeEventConditions(uint32_t nowMs,
                                           const Esp32BaseTime::Snapshot& now) {
    events_.observeTrustedTime(now.synced);
    Esp32BaseAppEvents::ObservedConditionState rollbackState =
        Esp32BaseAppEvents::ObservedConditionState::Unknown;
    if (wateringScheduler_.timeState() == WateringScheduler::TimeState::Ready) {
        rollbackState = Esp32BaseAppEvents::ObservedConditionState::Inactive;
    } else if (wateringScheduler_.timeState() == WateringScheduler::TimeState::RtcRollback) {
        rollbackState = Esp32BaseAppEvents::ObservedConditionState::Active;
    }
    events_.observeRtcRollback(rollbackState);

    const IrrigationConfig* config = configStore_.current();
    Esp32BaseAppEvents::ObservedConditionState flowState =
        Esp32BaseAppEvents::ObservedConditionState::Unknown;
    if (config && !wateringController_.status().active &&
        unexpectedFlowMonitor_.observationReady(nowMs)) {
        flowState = unexpectedFlowMonitor_.alarmActive()
                        ? Esp32BaseAppEvents::ObservedConditionState::Active
                        : Esp32BaseAppEvents::ObservedConditionState::Inactive;
    }
    events_.observeClosedValveFlow(
        flowState,
        unexpectedFlowMonitor_.observedPulseCount(),
        config ? config->flowProtection.unexpectedFlowWindowSec : 0,
        config ? config->flowProtection.unexpectedFlowPulseCount : 0);
}

WateringStartResult IrrigationApp::startScheduledWatering(const WateringRequest& request,
                                                          void* user) {
    return user ? static_cast<IrrigationApp*>(user)->startWatering(request)
                : WateringStartResult::NotReady;
}

void IrrigationApp::handleSchedulerEvent(WateringScheduler::Event event,
                                         uint8_t planId,
                                         int32_t value,
                                         void* user) {
    if (user) {
        static_cast<IrrigationApp*>(user)->reportSchedulerEvent(event, planId, value);
    }
}

void IrrigationApp::reportSchedulerEvent(WateringScheduler::Event event,
                                         uint8_t planId,
                                         int32_t) {
    switch (event) {
        case WateringScheduler::Event::PausedIndefinitely:
            events_.recordAutomaticWateringPaused(true, 0);
            break;
        case WateringScheduler::Event::PausedUntil:
            events_.recordAutomaticWateringPaused(
                false, wateringScheduler_.automaticState().resumeAtEpoch);
            break;
        case WateringScheduler::Event::ResumedManually:
            events_.recordAutomaticWateringResumed(false);
            break;
        case WateringScheduler::Event::ResumedAutomatically:
            events_.recordAutomaticWateringResumed(true);
            break;
        case WateringScheduler::Event::PlanSkippedBusy:
            events_.recordAutomaticPlanSkipped(planId, true);
            break;
        case WateringScheduler::Event::PlanStartRejected:
            events_.recordAutomaticPlanSkipped(planId, false);
            break;
        case WateringScheduler::Event::StorageFault:
            schedulerStorageFault_ = true;
            events_.recordSchedulerStateSaveFailed();
            break;
    }
}

void IrrigationApp::afterFormatFs(const Esp32BaseWeb::FormatFsResult& result, void* user) {
    if (user) {
        static_cast<IrrigationApp*>(user)->handleAfterFormatFs(result);
    }
}

void IrrigationApp::handleAfterFormatFs(const Esp32BaseWeb::FormatFsResult& result) {
    BoardHardware& hardware = BoardHardware::instance();
    wateringController_.abortForMaintenance(millis());
    hardware.safeShutdown();
    businessReady_ = false;

    if (!result.mountSuccess) {
        recordStorageFault_ = true;
        events_.syncStorageStatus();
        return;
    }

    bool configReady = configStore_.begin();
    if (configReady) configReady = applyStoredParameterConfig();
    const IrrigationConfig* config = configStore_.current();
    const bool pwmReady = configReady && config &&
                          hardware.configureValvePwmFrequency(
                              config->valveDrive.pwmFrequencyHz);
    const bool schedulerCleared = wateringSchedulerStore_.clear();
    wateringScheduler_.setCallbacks(nullptr, nullptr, nullptr);
    const bool schedulerLoaded = wateringScheduler_.begin(wateringSchedulerStore_);
    wateringScheduler_.setCallbacks(startScheduledWatering, handleSchedulerEvent, this);
    const bool schedulerReady = schedulerCleared && schedulerLoaded;
    if (!schedulerReady) {
        wateringScheduler_.disable();
    }
    const bool checkpointReady = aliveCheckpoint_.begin();
    schedulerStorageFault_ = !schedulerReady;
    Esp32BaseRecordStore::StoreStatus recordStatus{};
    bool recordStatusReady = wateringRecordStore_.readStatus(recordStatus);
    bool recordStoreReady = recordStatusReady && recordStatus.ready &&
                            recordStatus.writable;
    if (!recordStoreReady) {
        ESP32BASE_LOG_W(
            "irrigation",
            "watering_record_store_recover_after_format base_reload=%s state=%s error=%s",
            result.businessRecordStoresReloadSuccess ? "success" : "failed",
            recordStatusReady
                ? Esp32BaseRecordStore::storeStateName(recordStatus.state)
                : "uninitialized",
            recordStatusReady && recordStatus.errorReason
                ? recordStatus.errorReason
                : "status_unavailable");
        recordStoreReady = wateringRecordStore_.begin();
        recordStatusReady = wateringRecordStore_.readStatus(recordStatus);
        recordStoreReady = recordStoreReady && recordStatusReady &&
                           recordStatus.ready && recordStatus.writable;
    }
    if (recordStoreReady && !wateringRecordStoreRegistered_) {
        wateringRecordStoreRegistered_ =
            Esp32BaseWeb::registerBusinessRecordStore(
                wateringRecordStore_.baseStore());
    }
    const bool recordsReady =
        wateringRecordStoreRegistered_ && recordStoreReady;
    if (!recordsReady) {
        ESP32BASE_LOG_E(
            "irrigation",
            "watering_record_store_recovery_failed registered=%s state=%s error=%s",
            wateringRecordStoreRegistered_ ? "yes" : "no",
            recordStatusReady
                ? Esp32BaseRecordStore::storeStateName(recordStatus.state)
                : "uninitialized",
            recordStatusReady && recordStatus.errorReason
                ? recordStatus.errorReason
                : "status_unavailable");
    }
    events_.syncStorageStatus();
    recordStorageFault_ = !recordsReady;
    businessReady_ = configReady && pwmReady;
    if (businessReady_) {
        resetUnexpectedFlowMonitor(millis());
    }
    if (!businessReady_) {
        hardware.safeShutdown();
    }
    ESP32BASE_LOG_W("irrigation",
                    "after_format_reinitialized business_ready=%s records_ready=%s scheduler_ready=%s checkpoint_ready=%s",
                    businessReady_ ? "yes" : "no",
                    recordsReady ? "yes" : "no",
                    schedulerReady ? "yes" : "no",
                    checkpointReady ? "yes" : "no");
}
